Get colored surface settings object from the style.
  Namespace:   Autodesk.Revit.DB.Analysis
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  Since:  2011
 Syntax
  C#
public AnalysisDisplayColoredSurfaceSettings GetColoredSurfaceSettings()
  Visual Basic
Public Function GetColoredSurfaceSettings As AnalysisDisplayColoredSurfaceSettings
  Visual C++
public:
AnalysisDisplayColoredSurfaceSettings^ GetColoredSurfaceSettings()
 Exceptions
  Exception  |   Condition
   Autodesk.Revit.Exceptions InvalidOperationException   |   colored surface settings were not created with the object.
 See Also
  AnalysisDisplayStyle Class
  Autodesk.Revit.DB.Analysis Namespace